Merge pull request #7 from qasirdev/epic/autonomus-implementation
Epic/autonomus implementation
